[A_DarkWisdom_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="黑暗智慧"
mTooltip="暗系法术获得 %stat1 %stat1.icon 魔力。其他每个智慧类能力都会增加 %stat1 %stat1.icon 魔力到此加成中。"

[A_DarkScholar_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="黑暗学者"
mTooltip="暗系法术的法力消耗降低 %special.norm%。"

[A_MasterOfDarkness_I_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗系学识I"
mTooltip="%spell1.name 和 %spell2.name 现在对目标4x4区域内的生物施放。"

[A_MasterOfDarkness_II_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗系学识II"
mTooltip="%spell1.name 额外使目标生物在 %spell1.spell.buff.buff.durini 回合内免疫正面法术和魔法效果。\n被 %spell2.name 攻击的敌方生物额外在 %spell2.spell.buff2.buff.buff1.buff.durini 回合内无法反击。"

[A_SoulHarvest_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="灵魂收割"
mTooltip="每当英雄攻击消灭至少一个生物时，英雄获得 %stat.norm %stat.icon 法力。"

[A_CatatonicFear_Ability H7HeroAbility]
mName="恐惧颤抖"
mTooltip="被恐惧攻击的敌方生物失去其反击能力。"
[A_Curse_Ability H7HeroAbility]
mName="诅咒"
mTooltip="法术废除还会为目标生物接下来的3回合添加一个减益：该生物无法成为正面法术或增益的目标。"
[A_CursedGround_Ability H7HeroAbility]
mName="诅咒大地"
mTooltip="虚弱无力和悲痛欲绝的目标为4x4区域内的所有敌方生物。"
[A_ImprovedTier1Spells_Ability H7HeroAbility]
mName="暗系学识I"
mTooltip="悲痛欲绝和虚弱无力的目标为4x4区域内的所有敌方生物。"
[A_ImprovedTier2Spells_Ability H7HeroAbility]
mName="暗系学识II"
mTooltip="被法术废除目标的生物在3回合内无法成为正面法术或增益的目标。被恐惧代言攻击的敌方生物失去其反击能力。"
[A_ImprovedTier3Spells_Ability H7HeroAbility]
mName="暗系学识III"
mTooltip="无尽痛苦的目标为4x4区域内的所有敌方生物。任何暗影镜像入场时都带有“暗影斗篷”增益，持续3回合，1层充能。"
[A_MassDespair_Ability H7HeroAbility]
mName="群体绝望"
mTooltip="悲痛欲绝的目标为4x4区域内的所有敌方生物。"
[A_ShadowOfDeath_Ability H7HeroAbility]
mName="死亡之影"
mTooltip="每当英雄对敌方生物施放暗系法术时，其队伍数量减少 %special%。以此方式损失的生物，如果其军队未被击败，将会返回。"
[A_ShadowVeil_Ability H7HeroAbility]
mName="暗影面纱"
mTooltip="暗影斗篷的目标为2x2区域内的所有友方生物。"

7.5_v2 :

[A_MasterOfDarkness_III_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="暗系学识III"
mTooltip="%spell1.name 现在对目标4x4区域内的生物施放。\n对 %spell2.name 的第一次攻击将会失手且不会摧毁它。此效果持续3回合。\n%spell3.name 影响6x6区域内的所有友军。"

v1.37

[A_ShadowOfDread_Ability H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="恐惧阴影"
mTooltip="每当英雄对敌方生物施放暗系法术时，其数量减少 %special（向下取整）。以此方式损失的生物，如果其军队未被击败，将会返回。\n当此效果触发时，此能力还会在剩余战斗时间内封锁敌方英雄的招魂术能力。\n如果英雄拥有所需知识，则有几率学会一个新的4级暗系法术。"

v1.41

[A_DarkMagic_Skill H7Skill]
mName="暗系魔法"
mTooltip="允许你在魔法行会学习暗系魔法学派的法术。改善并增强其效果。"
mDescriptions[0]="使暗系法术更有效，并提高英雄的 %ICON_ARCANE_KNOWLEDGE 魔力。"
mDescriptions[1]=""
mDescriptions[2]="使暗系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力提高1点。\n英雄有几率学会一个新的1级暗系法术。"
mDescriptions[3]="使暗系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高2点。\n如果英雄拥有所需知识，则有几率学会一个新的2级暗系法术。"
mDescriptions[4]="使暗系法术更有效，并将英雄的 %ICON_ARCANE_KNOWLEDGE 魔力额外提高3点。\n如果英雄拥有所需知识，则有几率学会一个新的3级暗系法术。\n\n与大师级<font color="#00588BFF">外交</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：白骨复仇。\n\n与大师级<font color="#00588BFF">经济</font>结合时，解锁<font color="#00FFCB44">协同能力</font>：赏金猎人。"